iotivity/iotivity-lite/port/esp32/adapter/src/ipadapter.c
#ifdef OC_IPV4
static int
add_mcast_sock_to_ipv4_mcast_group(int mcast_sock, const esp_ip4_addr_t *local)
{
  struct ip_mreq imreq;
  memset(&imreq, 0, sizeof(struct ip_mreq));
  // Configure source interface
  inet_addr_from_ip4addr(&imreq.imr_interface, local);
  imreq.imr_multiaddr.s_addr = htonl(ALL_COAP_NODES_V4);
  OC_DBG("Configured IPV4 Multicast address %s",
         inet_ntoa(imreq.imr_multiaddr.s_addr));

  if (!IP_MULTICAST(ntohl(imreq.imr_multiaddr.s_addr))) {
    OC_ERR("not a valid multicast address");
    return -1;
  }

  int err = setsockopt(mcast_sock, IPPROTO_IP, IP_MULTICAST_IF,
                       &imreq.imr_interface, sizeof(struct in_addr));
  if (err < 0) {
    OC_ERR("setsockopt IP_MULTICAST_IF ret:%d", err);
    return -1;
  }

#ifdef OC_LEAVE_GROUP
  err = setsockopt(mcast_sock, IPPROTO_IP, IP_DROP_MEMBERSHIP, &imreq,
                   sizeof(struct ip_mreq));
  if (err < 0) {
    OC_ERR("setsockopt IP_DROP_MEMBERSHIP ret:%d", err);
    return -1;
  }
#endif

  err = setsockopt(mcast_sock, IPPROTO_IP, IP_ADD_MEMBERSHIP, &imreq,
                   sizeof(struct ip_mreq));
  if (err < 0) {
    OC_ERR("setsockopt IP_ADD_MEMBERSHIP ret:%d", err);
    return -1;
  }
  return 0;
}
#endif /* OC_IPV4 */

static int
add_mcast_sock_to_ipv6_mcast_group(int mcast_sock, uint8_t if_index)
{
  uint8_t index = if_index;
  int err = setsockopt(mcast_sock, IPPROTO_IPV6, IPV6_MULTICAST_IF, &index,
                       sizeof(uint8_t));
  if (err != ESP_OK) {
    OC_ERR("Failed to set IPV6_MULTICAST_IF. Error %d", errno);
    return -1;
  }

  struct ipv6_mreq mreq;
  /* Link-local scope */
  memset(&mreq, 0, sizeof(mreq));
  memcpy(mreq.ipv6mr_multiaddr.s6_addr, ALL_OCF_NODES_LL, 16);
  mreq.ipv6mr_interface = if_index;

  (void)setsockopt(mcast_sock, IPPROTO_IPV6, IPV6_DROP_MEMBERSHIP, &mreq,
                   sizeof(mreq));

  if (setsockopt(mcast_sock, IPPROTO_IPV6, IPV6_ADD_MEMBERSHIP, &mreq,
                 sizeof(mreq)) == -1) {
    OC_ERR("joining link-local IPv6 multicast group %d", errno);
    return -1;
  }

  /* Realm-local scope */
  memset(&mreq, 0, sizeof(mreq));
  memcpy(mreq.ipv6mr_multiaddr.s6_addr, ALL_OCF_NODES_RL, 16);
  mreq.ipv6mr_interface = if_index;

  (void)setsockopt(mcast_sock, IPPROTO_IPV6, IPV6_DROP_MEMBERSHIP, &mreq,
                   sizeof(mreq));

  if (setsockopt(mcast_sock, IPPROTO_IPV6, IPV6_ADD_MEMBERSHIP, &mreq,
                 sizeof(mreq)) == -1) {
    OC_ERR("joining realm-local IPv6 multicast group %d", errno);
    return -1;
  }

  /* Site-local scope */
  memset(&mreq, 0, sizeof(mreq));
  memcpy(mreq.ipv6mr_multiaddr.s6_addr, ALL_OCF_NODES_SL, 16);
  mreq.ipv6mr_interface = if_index;

  (void)setsockopt(mcast_sock, IPPROTO_IPV6, IPV6_DROP_MEMBERSHIP, &mreq,
                   sizeof(mreq));

  if (setsockopt(mcast_sock, IPPROTO_IPV6, IPV6_ADD_MEMBERSHIP, &mreq,
                 sizeof(mreq)) == -1) {
    OC_ERR("joining site-local IPv6 multicast group %d", errno);
    return -1;
  }

  return 0;
}

static int
configure_mcast_socket(int mcast_sock, int sa_family)
{
  int ret = 0;
  for (esp_netif_t *esp_netif = esp_netif_next(NULL); esp_netif;
       esp_netif = esp_netif_next(esp_netif)) {
    if (!esp_netif_is_netif_up(esp_netif)) {
      continue;
    }
    int netif_index = esp_netif_get_netif_impl_index(esp_netif);
    if (netif_index < 0) {
      OC_ERR("esp_netif_get_netif_impl_index returns error");
      continue;
    }
    /* Accordingly handle IPv6/IPv4 addresses */
    if (sa_family == AF_INET6) {
      ret +=
        add_mcast_sock_to_ipv6_mcast_group(mcast_sock, (uint8_t)netif_index);
    }
#ifdef OC_IPV4
    else if (sa_family == AF_INET) {
      esp_netif_ip_info_t ip_info;
      if (esp_netif_get_ip_info(esp_netif, &ip_info) != ESP_OK) {
        OC_ERR("esp_netif_get_ip_info at interface_index(%d) returns error",
               netif_index);
        continue;
      }
      if (ip4_addr_isloopback(&ip_info.ip)) {
        continue;
      }
      ret += add_mcast_sock_to_ipv4_mcast_group(mcast_sock, &ip_info.ip);
    }
#endif /* OC_IPV4 */
  }
  return ret;
#if 0
  int ret = 0;
  struct ifaddrs *ifs = NULL;
  if (getifaddrs(&ifs) < 0) {
    OC_ERR("querying interface addrs");
    return -1;
  }
  for (struct ifaddrs* interface = ifs; interface != NULL; interface = interface->ifa_next) {
    /* Ignore interfaces that are down and the loopback interface */
    if (!(interface->ifa_flags & IFF_UP) ||
        (interface->ifa_flags & IFF_LOOPBACK)) {
      continue;
    }
    /* Ignore interfaces not belonging to the address family under consideration
     */
    if (interface->ifa_addr && interface->ifa_addr->sa_family != sa_family) {
      continue;
    }
    /* Obtain interface index for this address */
    unsigned if_index = if_nametoindex(interface->ifa_name);
    if (if_index == 0) {
      OC_ERR("failed obtaining interface(%s) index", interface->ifa_name);
      continue;
    }
    /* Accordingly handle IPv6/IPv4 addresses */
    if (sa_family == AF_INET6) {
      struct sockaddr_in6 *a = (struct sockaddr_in6 *)interface->ifa_addr;
      if (a && IN6_IS_ADDR_LINKLOCAL(&a->sin6_addr)) {
        ret += add_mcast_sock_to_ipv6_mcast_group(mcast_sock, if_index);
      }
    }
#ifdef OC_IPV4
    else if (sa_family == AF_INET) {
      struct sockaddr_in *a = (struct sockaddr_in *)interface->ifa_addr;
      if (a)
        ret += add_mcast_sock_to_ipv4_mcast_group(mcast_sock, &a->sin_addr);
    }
#endif /* OC_IPV4 */
  }
  freeifaddrs(ifs);
  return ret;
#endif
}

static void
get_interface_addresses(ip_context_t *dev, unsigned char family, uint16_t port,
                        bool secure, bool tcp)
{
  for (esp_netif_t *esp_netif = esp_netif_next(NULL); esp_netif;
       esp_netif = esp_netif_next(esp_netif)) {
    oc_endpoint_t ep;
    memset(&ep, 0, sizeof(oc_endpoint_t));
    int if_index = esp_netif_get_netif_impl_index(esp_netif);
    if (if_index < 0) {
      OC_ERR("esp_netif_get_netif_impl_index returns error");
      continue;
    }
    ep.interface_index = (unsigned)if_index;

    if (secure) {
      ep.flags |= SECURED;
    }
#ifdef OC_IPV4
    if (family == AF_INET) {
      ep.addr.ipv4.port = port;
    } else
#endif /* OC_IPV4 */
      if (family == AF_INET6) {
        ep.addr.ipv6.port = port;
      }
#ifdef OC_TCP
    if (tcp) {
      ep.flags |= TCP;
    }
#else
    (void)tcp;
#endif /* OC_TCP */
#ifdef OC_IPV4
    if (family == AF_INET) {
      esp_netif_ip_info_t ip_info;
      if (esp_netif_get_ip_info(esp_netif, &ip_info) != ESP_OK) {
        OC_ERR("esp_netif_get_ip_info at interface_index(%d) returns error",
               ep.interface_index);
        return;
      }
      if (ip4_addr_isany(&ip_info.ip) || ip4_addr_isloopback(&ip_info.ip)) {
        return;
      }
      memcpy(ep.addr.ipv4.address, &ip_info.ip, 4);

      ep.flags |= IPV4;
      oc_endpoint_t *new_ep = oc_memb_alloc(&device_eps);
      if (!new_ep) {
        return;
      }
      memcpy(new_ep, &ep, sizeof(oc_endpoint_t));
      OC_DBG("add ep: %d %d %d %d", (int)family, (int)port, (int)secure,
             (int)tcp);
      OC_LOGipaddr(OC_LOG_LEVEL_DEBUG, ep);
      OC_DBG("interface index %d", ep.interface_index);
      OC_DBG("%s", "");
      oc_list_add(dev->eps, new_ep);
    } else
#endif /* OC_IPV4 */
      if (family == AF_INET6) {
        ep.flags |= IPV6;
        esp_ip6_addr_t if_ip6[LWIP_IPV6_NUM_ADDRESSES];
        int num = esp_netif_get_all_ip6(esp_netif, if_ip6);
        for (int i = 0; i < num; ++i) {
          if (ip6_addr_isany(&if_ip6[i]) || ip6_addr_isloopback(&if_ip6[i])) {
            continue;
          }
          memcpy(ep.addr.ipv6.address, &if_ip6[i].addr, 16);
          ep.addr.ipv6.scope = if_ip6[i].zone;
          oc_endpoint_t *new_ep = oc_memb_alloc(&device_eps);
          if (!new_ep) {
            return;
          }
          memcpy(new_ep, &ep, sizeof(oc_endpoint_t));
          OC_DBG("add ep: %d %d %d %d", (int)family, (int)port, (int)secure,
                 (int)tcp);
          OC_LOGipaddr(OC_LOG_LEVEL_DEBUG, ep);
          OC_DBG("interface index %d", ep.interface_index);
          OC_DBG("%s", "");
          oc_list_add(dev->eps, new_ep);
        }
      }
  }
}

static void
free_endpoints_list(ip_context_t *dev)
{
  oc_endpoint_t *ep = oc_list_pop(dev->eps);

  while (ep != NULL) {
    oc_memb_free(&device_eps, ep);
    ep = oc_list_pop(dev->eps);
  }
}

static void
refresh_endpoints_list(ip_context_t *dev)
{
  free_endpoints_list(dev);

  get_interface_addresses(dev, AF_INET6, dev->port, false, false);
#ifdef OC_SECURITY
  get_interface_addresses(dev, AF_INET6, dev->dtls_port, true, false);
#endif /* OC_SECURITY */
#ifdef OC_IPV4
  get_interface_addresses(dev, AF_INET, dev->port4, false, false);
#ifdef OC_SECURITY
  get_interface_addresses(dev, AF_INET, dev->dtls4_port, true, false);
#endif /* OC_SECURITY */
#endif /* OC_IPV4 */

