iotivity/iotivity-lite/port/esp32/adapter/src/ipadapter.c
#ifdef OC_IPV4
  if (FD_ISSET(dev->server4_sock, fds)) {
    int count = recv_msg(dev->server4_sock, message->data, OC_PDU_SIZE,
                         &message->endpoint, false);
    if (count < 0) {
      return ADAPTER_STATUS_ERROR;
    }
    message->length = (size_t)count;
    message->endpoint.flags = IPV4;
    FD_CLR(dev->server4_sock, fds);
    return ADAPTER_STATUS_RECEIVE;
  }

  if (FD_ISSET(dev->mcast4_sock, fds)) {
    int count = recv_msg(dev->mcast4_sock, message->data, OC_PDU_SIZE,
                         &message->endpoint, true);
    if (count < 0) {
      return ADAPTER_STATUS_ERROR;
    }
    message->length = (size_t)count;
    message->endpoint.flags = IPV4 | MULTICAST;
    FD_CLR(dev->mcast4_sock, fds);
    return ADAPTER_STATUS_RECEIVE;
  }
#endif /* OC_IPV4 */

#ifdef OC_SECURITY
  if (FD_ISSET(dev->secure_sock, fds)) {
    int count = recv_msg(dev->secure_sock, message->data, OC_PDU_SIZE,
                         &message->endpoint, false);
    if (count < 0) {
      return ADAPTER_STATUS_ERROR;
    }
    message->length = (size_t)count;
    message->endpoint.flags = IPV6 | SECURED;
    message->encrypted = 1;
    FD_CLR(dev->secure_sock, fds);
    return ADAPTER_STATUS_RECEIVE;
  }
#ifdef OC_IPV4
  if (FD_ISSET(dev->secure4_sock, fds)) {
    int count = recv_msg(dev->secure4_sock, message->data, OC_PDU_SIZE,
                         &message->endpoint, false);
    if (count < 0) {
      return ADAPTER_STATUS_ERROR;
    }
    message->length = (size_t)count;
    message->endpoint.flags = IPV4 | SECURED;
    message->encrypted = 1;
    FD_CLR(dev->secure4_sock, fds);
    return ADAPTER_STATUS_RECEIVE;
  }
#endif /* OC_IPV4 */
#endif /* OC_SECURITY */

  return ADAPTER_STATUS_NONE;
}

#ifdef OC_DYNAMIC_ALLOCATION
static bool
fd_sets_are_equal(const fd_set *fd1, const fd_set *fd2)
{
  return (memcmp(fd1, fd2, sizeof(fd_set)) == 0);
}

static int
fds_max(const fd_set *sourcefds)
{
  int max_fd = 0;
  for (int i = 0; i < FD_SETSIZE; i++) {
    if (FD_ISSET(i, sourcefds)) {
      max_fd = i;
    }
  }
  return max_fd;
}

static int
fds_count(const fd_set *sourcefds, int max_fd)
{
  int rfd_count = 0;
  for (int i = 0; i <= max_fd; i++) {
    if (FD_ISSET(i, sourcefds)) {
      rfd_count++;
    }
  }
  return rfd_count;
}

static int
pick_random_fd(const fd_set *sourcefds, int fd_count, int max_fd)
{
  assert(fd_count > 0);
  // get random number representing the position of descriptor in the fd_set
  int random_pos = (int)(oc_random_value() % fd_count);
  for (int i = 0, fd_pos = 0; i <= max_fd; i++) {
    if (FD_ISSET(i, sourcefds)) {
      if (random_pos == fd_pos) {
        return i;
      }
      // advance to the position
      fd_pos++;
    }
  }
  return -1;
}

static int
remove_random_fds(fd_set *rdfds, int rfds_count, int max_fd, int remove_count)
{
  int removed = 0;
  while (removed < remove_count) {
    int fd = pick_random_fd(rdfds, rfds_count, max_fd);
    if (fd < 0) {
      break;
    }
    // remove file descriptor from the set
    FD_CLR(fd, rdfds);
    --rfds_count;
    ++removed;
  }
  return removed;
}
#endif /* OC_DYNAMIC_ALLOCATION */

static bool
process_wakeup_signal(ip_context_t *dev, fd_set *fds)
{
  if (FD_ISSET(dev->wakeup_pipe[0], fds)) {
    FD_CLR(dev->wakeup_pipe[0], fds);
    ssize_t len;
    do {
      char buf;
      // write to pipe shall not block - so read the byte we wrote
      len = read(dev->wakeup_pipe[0], &buf, 1);
    } while (len < 0 && errno == EINTR);
    return true;
  }
  return false;
}

static void
add_control_flow_rfds(fd_set *output_set, const ip_context_t *dev)
{
  /* Monitor network interface changes on the platform from only the 0th
   * logical device

  if (dev->device == 0) {
    FD_SET(ifchange_sock, output_set);
  }
  */
  FD_SET(dev->wakeup_pipe[0], output_set);
}

static int
process_socket_read_event(ip_context_t *dev, fd_set *rdfds)
{
  oc_message_t *message = oc_allocate_message();
  if (message == NULL) {
    return -1;
  }
  message->endpoint.device = dev->device;

  if (oc_udp_receive_message(dev, rdfds, message) == ADAPTER_STATUS_RECEIVE) {
    OC_DBG("network_event_thread oc_udp_receive_message");
    goto receive;
  }
#ifdef OC_TCP
  if (oc_tcp_receive_message(dev, rdfds, message) == ADAPTER_STATUS_RECEIVE) {
    OC_DBG("network_event_thread oc_tcp_receive_message");
    goto receive;
  }
#endif /* OC_TCP */

  oc_message_unref(message);
  return 0;

receive:
  OC_TRACE("Incoming message of size %zd bytes from", message->length);
  OC_LOGipaddr(OC_LOG_LEVEL_TRACE, message->endpoint);
  OC_TRACE("interface index %d", message->endpoint.interface_index);
  OC_TRACE("%s", "");

  oc_network_receive_event(message);
  return 1;
}

static int
process_event(ip_context_t *dev, fd_set *rdfds, fd_set *wfds)
{
  if (rdfds != NULL) {
    int ret = process_socket_read_event(dev, rdfds);
    if (ret != 0) {
      return ret;
    }
  }

#if OC_DBG_IS_ENABLED
  // GCOVR_EXCL_START
  if (rdfds != NULL) {
    for (int i = 0; i < FD_SETSIZE; ++i) {
      if (FD_ISSET(i, rdfds)) {
        OC_DBG("no handler found for read event (fd=%d)", i);
      }
    }
  }
  if (wfds != NULL) {
    for (int i = 0; i < FD_SETSIZE; ++i) {
      if (FD_ISSET(i, wfds)) {
        OC_DBG("no handler found for write event (fd=%d)", i);
      }
    }
  }
  // GCOVR_EXCL_STOP
#else  /* !OC_DBG_IS_ENABLED */
  (void)wfds;
#endif /* OC_DBG_IS_ENABLED */
  return 0;
}

static void
process_events(ip_context_t *dev, fd_set *rdfds, fd_set *wfds, int fd_count,
               int max_read_fd)
{
  if (fd_count == 0) {
    OC_TRACE("process_events: timeout");
    return;
  }

  OC_TRACE("processing %d events", fd_count);

  // process control flow events
  if (process_wakeup_signal(dev, rdfds)) {
    fd_count--;
  }

#ifdef OC_DYNAMIC_ALLOCATION
  // check if network queue can consume all 'ready' events
  int available_count = OC_DEVICE_MAX_NUM_CONCURRENT_REQUESTS -
                        (int)oc_network_get_event_queue_length(dev->device);
  if (available_count < fd_count) {
    // get the number of read file descriptors
    int rfds_count = fds_count(rdfds, max_read_fd);
    int removed = remove_random_fds(rdfds, rfds_count, max_read_fd,
                                    rfds_count - available_count);
    fd_count -= removed;
  }
#else  /* !OC_DYNAMIC_ALLOCATION */
  (void)max_read_fd;
#endif /* OC_DYNAMIC_ALLOCATION */

  for (int i = 0; i < fd_count; i++) {
    if (process_event(dev, rdfds, wfds) < 0) {
      break;
    }
  }
}

static void *
network_event_thread(void *data)
{
  ip_context_t *dev = (ip_context_t *)data;
  FD_ZERO(&dev->rfds);

  oc_udp_add_socks_to_fd_set(dev);
  add_control_flow_rfds(&dev->rfds, dev);
#ifdef OC_TCP
  oc_tcp_add_socks_to_fd_set(dev);
  oc_tcp_add_controlflow_socks_to_rfd_set(&dev->rfds, dev);
#endif /* OC_TCP */

