iotivity/iotivity-lite/port/esp32/adapter/src/ipadapter.c
  // int i, n;
  int max_read_fd = FD_SETSIZE;
  fd_set last_rdfds;
  FD_ZERO(&last_rdfds);

  while (dev->terminate != 1) {
    // setfds = dev->rfds;
    fd_set rdfds = dev->rfds;

#ifdef OC_DYNAMIC_ALLOCATION
    if (!fd_sets_are_equal(&rdfds, &last_rdfds)) {
      // fd set has changed -> recalculate max fd
      max_read_fd = fds_max(&rdfds);
      last_rdfds = rdfds;
    }

    if (oc_network_get_event_queue_length(dev->device) >=
        OC_DEVICE_MAX_NUM_CONCURRENT_REQUESTS) {
      // the queue is full -> add only control flow rfds
      FD_ZERO(&rdfds);
      add_control_flow_rfds(&rdfds, dev);
#ifdef OC_TCP
      oc_tcp_add_controlflow_socks_to_rfd_set(&rdfds, dev);
#endif /* OC_TCP */
    }
#endif /* OC_DYNAMIC_ALLOCATION */

    int n = select(FD_SETSIZE, &rdfds, NULL, NULL, NULL);

    if (dev->terminate) {
      break;
    }

    process_events(dev, &rdfds, NULL, n, max_read_fd);
  }
  return NULL;
}

static int
send_msg(int sock, struct sockaddr_storage *receiver, oc_message_t *message)
{
  char msg_control[CMSG_LEN(sizeof(struct sockaddr_storage))];
  struct iovec iovec[1];
  struct msghdr msg;

  memset(&msg, 0, sizeof(struct msghdr));
  msg.msg_name = (void *)receiver;
  msg.msg_namelen = sizeof(struct sockaddr_storage);

  msg.msg_iov = iovec;
  msg.msg_iovlen = 1;

  if (message->endpoint.flags & IPV6) {
    struct cmsghdr *cmsg;
    struct in6_pktinfo *pktinfo;

    msg.msg_control = msg_control;
    msg.msg_controllen = CMSG_SPACE(sizeof(struct in6_pktinfo));
    memset(msg.msg_control, 0, msg.msg_controllen);

    cmsg = CMSG_FIRSTHDR(&msg);
    cmsg->cmsg_level = IPPROTO_IPV6;
    cmsg->cmsg_type = IPV6_PKTINFO;
    cmsg->cmsg_len = CMSG_LEN(sizeof(struct in6_pktinfo));

    pktinfo = (struct in6_pktinfo *)CMSG_DATA(cmsg);
    memset(pktinfo, 0, sizeof(struct in6_pktinfo));

    /* Get the outgoing interface index from message->endpint */
    pktinfo->ipi6_ifindex = message->endpoint.interface_index;
    /* Set the source address of this message using the address
     * from the endpoint's addr_local attribute.
     */
    memcpy(&pktinfo->ipi6_addr, message->endpoint.addr_local.ipv6.address, 16);
  }
#ifdef OC_IPV4
  else if (message->endpoint.flags & IPV4) {
    struct cmsghdr *cmsg;
    struct in_pktinfo *pktinfo;

    msg.msg_control = msg_control;
    msg.msg_controllen = CMSG_SPACE(sizeof(struct in_pktinfo));
    memset(msg.msg_control, 0, msg.msg_controllen);

    cmsg = CMSG_FIRSTHDR(&msg);
    cmsg->cmsg_level = IPPROTO_IP;
    cmsg->cmsg_type = IP_PKTINFO;
    cmsg->cmsg_len = CMSG_LEN(sizeof(struct in_pktinfo));

    pktinfo = (struct in_pktinfo *)CMSG_DATA(cmsg);
    memset(pktinfo, 0, sizeof(struct in_pktinfo));

    pktinfo->ipi_ifindex = message->endpoint.interface_index;
    memcpy(&pktinfo->ipi_spec_dst, message->endpoint.addr_local.ipv4.address,
           4);
  }
#else  /* OC_IPV4 */
  else {
    OC_ERR("invalid endpoint");
    return -1;
  }
#endif /* !OC_IPV4 */

  int bytes_sent = 0, x;
  while (bytes_sent < (int)message->length) {
    iovec[0].iov_base = message->data + bytes_sent;
    iovec[0].iov_len = message->length - (size_t)bytes_sent;
    x = sendmsg(sock, &msg, 0);
    if (x < 0) {
      OC_WRN("sendto() returned errno %d", errno);
      break;
    }
    bytes_sent += x;
  }
  OC_TRACE("Sent %d bytes", bytes_sent);

  if (bytes_sent == 0) {
    return -1;
  }

  return bytes_sent;
}

int
oc_send_buffer(oc_message_t *message)
{
  OC_TRACE("Outgoing message of size %zd bytes to", message->length);
  OC_LOGipaddr_local(OC_LOG_LEVEL_TRACE, message->endpoint);
  OC_TRACE("-->");
  OC_LOGipaddr(OC_LOG_LEVEL_TRACE, message->endpoint);
  OC_TRACE("%s", "");

  ip_context_t *dev = get_ip_context_for_device(message->endpoint.device);
  if (dev == NULL) {
    return -1;
  }

  struct sockaddr_storage receiver = oc_socket_get_address(&message->endpoint);

#ifdef OC_TCP
  if (message->endpoint.flags & TCP) {
    return oc_tcp_send_buffer(dev, message, &receiver);
  }
#endif /* OC_TCP */

  int send_sock = -1;

#ifdef OC_SECURITY
  if (message->endpoint.flags & SECURED) {
#ifdef OC_IPV4
    if (message->endpoint.flags & IPV4) {
      send_sock = dev->secure4_sock;
    } else {
      send_sock = dev->secure_sock;
    }
#else  /* OC_IPV4 */
    send_sock = dev->secure_sock;
#endif /* !OC_IPV4 */
  } else
#endif /* OC_SECURITY */
#ifdef OC_IPV4
    if (message->endpoint.flags & IPV4) {
    send_sock = dev->server4_sock;
  } else {
    send_sock = dev->server_sock;
  }
#else  /* OC_IPV4 */
  {
    send_sock = dev->server_sock;
  }
#endif /* !OC_IPV4 */

  return send_msg(send_sock, &receiver, message);
}

int
oc_send_buffer2(oc_message_t *message, bool queue)
{
  (void)queue;
  return oc_send_buffer(message);
}

#ifdef OC_CLIENT
void
oc_send_discovery_request(oc_message_t *message)
{
  memset(&message->endpoint.addr_local, 0,
         sizeof(message->endpoint.addr_local));
  message->endpoint.interface_index = 0;

  ip_context_t *dev = get_ip_context_for_device(message->endpoint.device);

#define IN6_IS_ADDR_MC_REALM_LOCAL(ip6)                                        \
  ip6_addr_ismulticast(ip6) && ((((const uint8_t *)(ip6->addr))[1] & 0x0f) ==  \
                                OC_IPV6_ADDR_SCOPE_REALM_LOCAL)

  for (esp_netif_t *esp_netif = esp_netif_next(NULL); esp_netif;
       esp_netif = esp_netif_next(esp_netif)) {
    if (!esp_netif_is_netif_up(esp_netif)) {
      continue;
    }
    int mif = esp_netif_get_netif_impl_index(esp_netif);
    if (mif < 0) {
      continue;
    }

    if (message->endpoint.flags & IPV6) {
      esp_ip6_addr_t if_ip6[LWIP_IPV6_NUM_ADDRESSES];
      int num = esp_netif_get_all_ip6(esp_netif, if_ip6);
      for (int i = 0; i < num; ++i) {
        esp_ip6_addr_t *ip6 = &if_ip6[i];
        if (!ip6_addr_islinklocal(ip6)) {
          continue;
        }
        if (setsockopt(dev->server_sock, IPPROTO_IPV6, IPV6_MULTICAST_IF, &mif,
                       sizeof(mif)) == -1) {
          OC_ERR("setting socket option for default IPV6_MULTICAST_IF: %d",
                 errno);
          continue;
        }
        message->endpoint.interface_index = (unsigned)mif;
        if (ip6_addr_ismulticast_linklocal(ip6)) {
          message->endpoint.addr.ipv6.scope = mif;
          unsigned int hops = 1;
          setsockopt(dev->server_sock, IPPROTO_IPV6, IPV6_MULTICAST_HOPS, &hops,
                     sizeof(hops));
        } else if (IN6_IS_ADDR_MC_REALM_LOCAL(ip6)) {
          unsigned int hops = 255;
          setsockopt(dev->server_sock, IPPROTO_IPV6, IPV6_MULTICAST_HOPS, &hops,
                     sizeof(hops));
          message->endpoint.addr.ipv6.scope = 0;
        } else if (ip6_addr_ismulticast_sitelocal(ip6)) {
          unsigned int hops = 255;
          setsockopt(dev->server_sock, IPPROTO_IPV6, IPV6_MULTICAST_HOPS, &hops,
                     sizeof(hops));
          message->endpoint.addr.ipv6.scope = 0;
        }
        oc_send_buffer(message);
      }
    }
#ifdef OC_IPV4
    else if (message->endpoint.flags & IPV4) {
      esp_netif_ip_info_t ip_info;
      if (esp_netif_get_ip_info(esp_netif, &ip_info) != ESP_OK) {
        OC_ERR("esp_netif_get_ip_info at interface_index(%d) returns error",
               mif);
        continue;
      }
      if (ip4_addr_isany(&ip_info.ip) || ip4_addr_isloopback(&ip_info.ip)) {
        continue;
      }
      if (setsockopt(dev->server4_sock, IPPROTO_IP, IP_MULTICAST_IF,
                     &ip_info.ip, sizeof(ip_info.ip)) == -1) {
        OC_ERR("setting socket option for default IP_MULTICAST_IF: %d", errno);
        continue;
      }
      message->endpoint.interface_index = (unsigned)mif;
      oc_send_buffer(message);
    }
#endif /* OC_IPV4 */
  }
}
#endif /* OC_CLIENT */

#ifdef OC_NETWORK_MONITOR
int
oc_add_network_interface_event_callback(interface_event_handler_t cb)
{
  if (!cb)
    return -1;

  oc_network_interface_cb_t *cb_item =
    oc_memb_alloc(&oc_network_interface_cb_s);
  if (!cb_item) {
    OC_ERR("network interface callback item alloc failed");
    return -1;
  }

  cb_item->handler = cb;
  oc_list_add(oc_network_interface_cb_list, cb_item);
  return 0;
}

int
oc_remove_network_interface_event_callback(interface_event_handler_t cb)
{
  if (!cb)
    return -1;

  oc_network_interface_cb_t *cb_item =
    oc_list_head(oc_network_interface_cb_list);
  while (cb_item != NULL && cb_item->handler != cb) {
    cb_item = cb_item->next;
  }
  if (!cb_item) {
    return -1;
  }
  oc_list_remove(oc_network_interface_cb_list, cb_item);

  oc_memb_free(&oc_network_interface_cb_s, cb_item);
  return 0;
}

void
handle_network_interface_event_callback(oc_interface_event_t event)
{
  if (oc_list_length(oc_network_interface_cb_list) > 0) {
    oc_network_interface_cb_t *cb_item =
      oc_list_head(oc_network_interface_cb_list);
    while (cb_item) {
      cb_item->handler(event);
      cb_item = cb_item->next;
    }
  }
}
#endif /* OC_NETWORK_MONITOR */

